{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cls_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cls_conv_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cls_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "cls", 
      "attr": {"mode": "channel"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bbox_reg_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bbox_reg_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "bbox_reg", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4", 
        "stride": "(1, 1)", 
        "workspace": "2048"
      }, 
      "inputs": [[16, 0, 0], [21, 0, 0], [22, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    12, 
    13, 
    15, 
    17, 
    18, 
    21, 
    22
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24
  ], 
  "heads": [[20, 0, 0], [23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}