{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pooling", 
      "name": "loc_pool0", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "loc_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "loc_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "loc_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "loc_pool1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "loc_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "loc_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "loc_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "loc_pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_conv3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "loc_conv3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_bn3_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn3_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "loc_bn3", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "loc_relu3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "loc_pool3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc__fc4_weight", 
      "attr": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc__fc4_bias", 
      "attr": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "loc__fc4", 
      "attr": {"num_hidden": "64"}, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "loc_bn4_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn4_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn4_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "loc_bn4_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "loc_bn4", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "loc_relu4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stn_loc_weight", 
      "attr": {
        "__lr_mult__": "0.1", 
        "num_hidden": "6"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stn_loc_bias", 
      "attr": {
        "__lr_mult__": "0.1", 
        "num_hidden": "6"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "stn_loc", 
      "attr": {
        "__lr_mult__": "0.1", 
        "num_hidden": "6"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "SpatialTransformer", 
      "name": "stn", 
      "attr": {
        "sampler_type": "bilinear", 
        "target_shape": "(112, 96)", 
        "transform_type": "affine"
      }, 
      "inputs": [[0, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[50, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[60, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 1], [75, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[79, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[96, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[103, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[113, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[132, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 1], [145, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[149, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 1], [162, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[166, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_sc", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[173, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[183, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn1", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn2", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 1], [198, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[202, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_gamma", 
      "attr": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
